#TOKEN TO GET CONTROL OF TELEGRAM BOT
TOKEN = '1031615541:AAHzP4D7w7fhk5jhpsONRQgqShrfcP-y2Dw'

#DICTIONARY WHICH IS MAIN TO CONTROL VOICE ASSISTANT
opts = {
    "ru-Ru": 
    {
        'alias': ('вася', 'василий', 'друг мой', 'друг', 'василиос', 'васька', 'василиса', 'васёк', 'васек', 'васенька', 'васян', 'слуга'),

        'tbr': ('скажи', 'розкажи', 'покажи', 'сколько', 'произнеси', 'включи', 'поищи', 'включи' , 'покажи', 'поменяй','измени', 'переведи',
                'обнови', 'обновить', 'загрузи', 'загрузить'),

        'answers': ("На заданный день занятий не найдено!",             # 0
                    "в аудитории:", "Преподователь:",                   # 1, 2
                    "Язык поменян на",                                  # 3
                    "Здраствуй, мой хозяин!",  "Василиса слушает",      # 4, 5
                    "Обновляю... Подождите пожалуйста.",                # 6
                    "Команда не распознана!",                           # 7
                    "По указанному запросу у вас столько занятий: ",    # 8
                    "База даных  успешно обновлена!",                   # 9
                    "Что-то пошло не поп плану"),                       # 10     

        'cmds': 
        {
            'update': ('базу данных', 'база данных', 'база', 'базу', 'обнови рассписание', 'хранилище', 'данные', 'данние'),

            'user': ("информацию пользователя", "информация", "информацию", "пользователя", "пользователь", "факультет и группа", "факультет и группу", "факультет", "група"),

            'lang': ('измени язык', 'поменяй язик', 'переведи интерфейс', 'переведи содержание', 'переведи','язик','язык'),

            'schedule': ('рассписание', 'пары', 'пари', 'занятия', 'пара', 'какие пары', 'какие пари'),
            
            'ctime': ('текущее время', 'сейчас времени', 'который час', 'время', 'посмотри на часы')       
        }
    },
    
    "uk-Uk" : 
    {
        'alias': ('вася', 'василь', 'друг мій', 'друг', 'друже', 'васька', 'василиса', 'василіса', 'васян'),

        'tbr': ('скажи', 'розкажи', 'покажи', 'скільки', 'промов','включи', 'пошукай','знайди', 
                'включи' , 'покажи', 'онови', 'оновити', 'завантажити', 'завантаж', 'загрузи'),


        'answers': ("У вибраний день занять не знайдено.",              # 0
                    "в аудиторії:", "Викладач:",                        # 1, 2
                    "Мову змінено на ",                                 # 3
                    "Доброго дня, хазяїне!",  "Василіса слухає",        # 4, 5
                    "Оновлюю... зачекайте будь-ласка",                  # 6
                    "Команда не розпізнана!",                           # 7
                    "За даним запитом у вас стільки занять: ",          # 8
                    "Базу даних успішно оновлено!",                     # 9
                    "Щось пішло не за планом." ,                        # 10
                    "Дані користувача були змінені на: "),              # 11   

        'cmds': 
        {
            'user': ('інформацію користувача','інформацію', "інформація", 'дані', 'користувач', 'факультет і група', 'факультет', 'група', 
            'факультет та група', 'група', 'факультет і групу',),
        
            'update': ('базу даних', 'база даних', 'база', 'базу', 'онови рассписание', 'сховище', 'дані', 'данні'),

            'lang': ('зміни мову', 'переклади інтерфейс', 'переклади вміст', 'переклади','поміняй мову','мову','мова',),

            'schedule': ('розклад', 'пари', 'заняття', 'пара', 'які пари', 'какие заняття'),
    
        }
    },

    "en-En" :
    {
        'alias': ('vasya', 'vasyl', 'my friend', 'friend', 'bro', 'brother', 'vaska', 'vasilisa'),

        'tbr': ('tell', 'show', 'speak', 'turn on', 'search', 'find', 'look for', 'demonstrate', 'update', 'download'),

        'answers': ("No classes found for the given day!",              # 0
                    "in the audience:", "Teacher:",                     # 1, 2
                    "The language is changed to",                       # 3
                    "Hello my master!",  "Vasilisa is listening",       # 4, 5
                    "Updating ... Wait, please.",                       # 6
                    "The command is not recognized!",                   # 7 
                    "For this request, you have so many classes: ",     # 8 
                    "Database succesfully updated",                     # 9
                    "Something went wrong."),                           # 10

        'cmds': 
        {
            'user': ('user data', 'user info', 'info', 'group info', 'user group', 'faculty and group', 'faculty'),

            'update': ('database', 'data', 'base', 'update data', 'update database', 'storage', 'update storage'),

            'lang': ('change language', 'language', 'languages', 'interface', 'translate interface', 'translate content', 'content'),

            'schedule': ('schedule', 'lessons', 'lesson', 'which lesson')
    
        }
    }

}


faculties = ("ІІКАО", "ІНТІЛ", "АКФ", "ННІНО", "ФККПІ", "ФАБД", "ФАЕТ", 
             "ФЕБІТ", "ФЕБА", "ФЛСК", "ФМВ", "ФТМЛ", "ЦМО", "ЮФ")


langs = {
    'uk-Uk': ('ukrainian', 'украинский', 'українську'),

    'ru-Ru': ('російська', 'russian', "русский"),
    'en-En': ('англійська', 'английский', 'english'),
}

days = {
    "uk-Uk":
    {
        'today': ('сьогодні', 'зараз'),
        'after tommorow': ('післязавтра', 'після', 'через день'),
        'tommorow': ('завтра', 'потім'),
    },
    "ru-Ru":
    {
        'today': ('сегодня', 'сейчас'),
        'after tommorow': ('послезавтра', 'после', 'через день'),
        'tommorow': ('завтра', 'потом'),
    },
    "en-En":
    {
        'today': ('today', 'now'),
        'after tommorow': ('after tommorow', 'after', 'in one day'),
        'tommorow': ('tommorow', 'later'),
    },
}

