#TOKEN TO GET CONTROL OF TELEGRAM BOT
TOKEN = '1031615541:AAHzP4D7w7fhk5jhpsONRQgqShrfcP-y2Dw'

#DICTIONARY WHICH IS MAIN TO CONTROL VOICE ASSISTANT
opts = {
    'alias': ('вася','василий','дибил','друг мой','друг','деллка','василиос',
                'васька','василиса','васёк','васек','васенька','васян','слуга'),

    'tbr': ('скажи','розкажи','покажи','сколько','произнеси','включи', 'поищи', 'включи' , 'покажи' ,'' ,'' ),

    'cmds': {
        'find': ('найди песню', 'найди клип','найди группу','найди групу','найди','ютуб','песня','песню','группа','група','группу','групу', 'клип', 'видео', 'youtube'),
        
        'schedule': ('рассписание','пары','пари','заняния','пара', 'какие пары', 'какие пари'),
        
        'ctime': ('текущее время','сейчас времени','который час','время','посмотри на часы')
        

    }
}
